<!-- add-pr-comment:rds_plan -->

# production/rds Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # data.aws_iam_policy_document.backup_notifications will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "backup_notifications" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + principals {
              + identifiers = [
                  + "backup.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }
  # aws_backup_plan.rds will be created
  + resource "aws_backup_plan" "rds" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "notification-canada-ca-production-rds-plan"
      + region   = "ca-central-1"
      + tags     = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + version  = (known after apply)
      + rule {
          + completion_window            = 240
          + enable_continuous_backup     = false
          + recovery_point_tags          = {
              + "CostCenter" = "notification-canada-ca-production"
              + "Terraform"  = "true"
            }
          + rule_name                    = "daily-backup"
          + schedule                     = "cron(0 7 * * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 120
          + target_vault_name            = "notification-canada-ca-production-rds-vault"
          + lifecycle {
              + delete_after                              = 8
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }
  # aws_backup_selection.rds will be created
  + resource "aws_backup_selection" "rds" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "notification-canada-ca-production-rds-selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)
      + region        = "ca-central-1"
      + resources     = [
          + "arn:aws:rds:ca-central-1:296255494825:cluster:notification-canada-ca-production-cluster",
        ]
      + condition (known after apply)
    }
  # aws_backup_vault.rds will be created
  + resource "aws_backup_vault" "rds" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "notification-canada-ca-production-rds-vault"
      + recovery_points = (known after apply)
      + region          = "ca-central-1"
      + tags            = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # aws_backup_vault_lock_configuration.rds[0] will be created
  + resource "aws_backup_vault_lock_configuration" "rds" {
      + backup_vault_arn    = (known after apply)
      + backup_vault_name   = "notification-canada-ca-production-rds-vault"
      + changeable_for_days = 365
      + id                  = (known after apply)
      + max_retention_days  = 8
      + min_retention_days  = 7
      + region              = "ca-central-1"
    }
  # aws_backup_vault_notifications.rds will be created
  + resource "aws_backup_vault_notifications" "rds" {
      + backup_vault_arn    = (known after apply)
      + backup_vault_events = [
          + "BACKUP_JOB_COMPLETED",
          + "BACKUP_JOB_FAILED",
          + "RESTORE_JOB_COMPLETED",
          + "RESTORE_JOB_FAILED",
        ]
      + backup_vault_name   = "notification-canada-ca-production-rds-vault"
      + id                  = (known after apply)
      + region              = "ca-central-1"
      + sns_topic_arn       = (known after apply)
    }
  # aws_iam_role.backup will be created
  + resource "aws_iam_role" "backup" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AWSBackupRole-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "AWSBackupRole-production"
    }
  # aws_iam_role_policy_attachment.backup_restore will be created
  + resource "aws_iam_role_policy_attachment" "backup_restore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForRestores"
      + role       = "AWSBackupRole-production"
    }
  # aws_kms_alias.backup_vault will be created
  + resource "aws_kms_alias" "backup_vault" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/backup-vault-production"
      + name_prefix    = (known after apply)
      + region         = "ca-central-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }
  # aws_kms_key.backup_vault will be created
  + resource "aws_kms_key" "backup_vault" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for RDS backup vault encryption - production"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::296255494825:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKeyWithoutPlaintext",
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:ViaService" = "backup.ca-central-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow AWS Backup to use the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ca-central-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # aws_sns_topic.backup_notifications will be created
  + resource "aws_sns_topic" "backup_notifications" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "notification-canada-ca-production-backup-notifications"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ca-central-1"
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }
  # aws_sns_topic_policy.backup_notifications will be created
  + resource "aws_sns_topic_policy" "backup_notifications" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "ca-central-1"
    }
Plan: 12 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```